package com.java;

public class Test {

	public static void main(String[] args) {

		System.out.println("HELLO");
		
		/* ************************
		 * 0. 객체(object > class)
		 * 1. 변수
		 * 2. 메소드 (method)
		 * 3. 출력
		 * 4. 연산 (사칙연산)
		 * 5. 접근제한자
		 * 6. 정적(static) 공유할수잇는것인데 변하지 않는것 상수같은것
		 * 7. 리턴타입 (void) 메소드에 해당, 메소드에 돌려받는 값이 없다라는 것.
		 * 8. 자료형 기본자료형, 객체
		 * 9. 매계변수 (메소드 호출시 같이 보냄) 
		 * ************************/
		/* ************************
		 * 변수 사용법
		 * 1. 변수 선언
		 * 2. 변수에 데이터 대입(값 담기)
		 * 3. 변수 사용
		 * ************************/
		
		// 객체(class) 객체 변수      대입  (생성키워드) (객체 생성자)
		//   Var        v      =    new       Var();
		
		new Var();
		// 정적으론 만들때는 꼭 필요할 때.
		

	}
}
